# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [7]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names.groupby(['Gender']).count()

          Name    Year   State   Count
Gender
F       558846  558846  558846  558846
M       457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [10]:
names = baby_names.groupby(['Name'])

### Step 8. How many different names exist in the dataset?

In [14]:
names.sum().shape[0]

17632

### Step 9. What is the name with most occurrences?

In [39]:
names.count().sort_values(by=['Count'], ascending=False).iloc[0]

Year      1112
Gender    1112
State     1112
Count     1112
Name: Riley, dtype: int64

In [51]:
names.count().loc['Jacob']

Year      568
Gender    568
State     568
Count     568
Name: Jacob, dtype: int64

### Step 10. How many different names have the least occurrences?

In [52]:
counts = names.count()
counts[counts['Count'] == 1].count()

Year      3682
Gender    3682
State     3682
Count     3682
dtype: int64

### Step 11. What is the median name occurrence?

In [46]:
counts['Count'].median()

8.0

### Step 12. What is the standard deviation of names?

In [54]:
names['Count'].std()

Name
Aaban           0.000000
Aadan           0.957427
Aadarsh              NaN
Aaden          21.154974
Aadhav               NaN
Aadhya          8.118947
Aadi            2.624022
Aadin                NaN
Aadit           1.000000
Aaditya         2.164905
Aadya           3.847077
Aadyn           1.103713
Aahan           1.414214
Aahana          3.172801
Aahil           3.355330
Aahna                NaN
Aaiden          2.928984
Aaima                NaN
Aakash          1.348597
Aalaya               NaN
Aalayah         1.131111
Aaleah          0.000000
Aaleyah         4.418436
Aalia           1.118034
Aaliah          3.880967
Aalijah         0.000000
Aaliya          2.144038
Aaliyah       111.884049
Aaliyha         0.500000
Aalyah          2.182315
                 ...
Zyir            0.000000
Zyire                NaN
Zykeria         4.762147
Zykeriah             NaN
Zykerria        1.788854
Zykia           2.500000
Zykierra             NaN
Zykira          2.828427
Zykiria         0.707107
Zyla            1.251470
Zylah           1.398412
Zylan           0.577350
Zylen           1.414214
Zyler           1.593255
Zymari               NaN
Zymarion        0.000000
Zymere          1.652504
Zymier          0.577350
Zymiere         0.000000
Zymir           4.195621
Zymire          0.000000
Zyon            3.496897
Zyonna          0.934199
Zyquan          1.154701
Zyquavious           NaN
Zyra            1.154701
Zyrah           0.707107
Zyren                NaN
Zyria           0.737865
Zyriah          1.666667
Name: Count, Length: 17632, dtype: float64

### Step 13. Get a summary with the mean, min, max, std and quartiles.